Revit 2027 API
ElectricalSystem.RunsNumber Property
 The Runs Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int RunsNumber { get; }
Public ReadOnly Property RunsNumber As Integer
	Get
public:
property int RunsNumber {
	int get ();
}
member RunsNumber : int with get
Property Value
Int32
Exceptions
Exception | Condition
InvalidOperationException |  This property only available when System Type is Power!
Remarks
 This property is used to retrieve the Runs Number of the Electrical System.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace